infra.html
<!doctype html>
<html lang="en">
  <head>
    <meta
  name="go-import"
  content="twos.dev
           git https://github.com/glacials/twos.dev"
/>
<meta
  name="go-source"
  content="twos.dev
           https://github.com/glacials/twos.dev
           https://github.com/glacials/twos.dev/tree/main{/dir}
           https://github.com/glacials/twos.dev/blob/main{/dir}/{file}#L{line}"
/>
<meta charset="utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width,initial-scale=1.0" />
<meta name="description" content="
My Infrastructure
" />
<link
  rel="alternate"
  type="application/rss+xml"
  title="twos.dev"
  href="/feed.rss"
/>
<link
  rel="alternate"
  type="application/atom+xml"
  title="twos.dev"
  href="/feed.atom"
/>
<title>Ben Carlsson / 
My Infrastructure
</title>
<link rel="stylesheet" href="/style.css" />

<link
  rel="stylesheet"
  href="https://cdn.jsdelivr.net/npm/katex@0.16.0/dist/katex.min.css"
  integrity="sha384-Xi8rHCmBmhbuyyhbI88391ZKP2dmfnOl4rT9ZfRI7mLTdk1wblIUnrIq35nqwEvC"
  crossorigin="anonymous"
/>
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png?v=2" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png?v=2" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png?v=2" />
<link rel="manifest" href="/site.webmanifest?v=2" />
<link rel="mask-icon" href="/safari-pinned-tab.svg?v=2" color="#5bbad5" />
<link rel="shortcut icon" href="/favicon.ico?v=2" />
<meta name="msapplication-TileColor" content="#da532c" />
<meta name="theme-color" content="#ffffff" />


  </head>

  <body>
    <div class="container">
      <nav class="primary"><div class="breadcrumb">
      <a href="/"><div class="nav-text">Ben Carlsson</div></a>
    </div></nav>

      <article>
        <a href="infra.html"><h1>
My Infrastructure
</h1></a>
        
          <div class="draft">Draft</div>
        
        
        
        <html><head></head><body><div id="outline-container-headline-1" class="outline-1">

<div id="outline-text-headline-1" class="outline-text-1">
<p>
I've had a lot of side projects. Some are global in nature and get a lot of
users. Some are meant just for me. Some start one way and end the other.</p>
<p>
In some areas of dealing with all these side projects I've developed some
patterns. In others I'm still exploring. On this page I'll detail where those
lines lie and where they're still shifting.</p>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Version Control
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>We'll get the easy stuff out of the way first. My projects are open source by
default. Starting a GitHub repository is emotionally necessary for me to begin
to write software. It is the source of truth for everything in my life that
involves code, whether projects or dotfiles or the file you're reading right
now.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Deploys
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>I am staunchly <a href="https://en.wikipedia.org/wiki/Continuous_deployment" target="_blank">CD</a>. Pushes to <code class="verbatim">main</code> automatically deploy any given project
whether it's a service with 10k users or a dinky home automation script. I don't
need another step between writing code and getting it out there.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Infrastructure
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>I'm just starting to understand the appeal of the Kubernetes train, but it
honestly seems like a bit much for my lil old dinky side projects. I was within
an inch of getting things up and running in Docker Swarm, which I'm honestly
surprised didn't take off more with how simple it is in comparison.</p>
<p>
I have two directions I go here for big projects, which I'll represent as
<a href="https://whatsinstandard.com/" target="_blank">What's in Standard?</a> and <a href="https://splits.io" target="_blank">Splits.io</a>.</p>
<p>
For static or mostly static websites like <em>What's in Standard?</em> I will opt to
use the heck out of GitHub Pages and GitHub Actions to avoid having to manage or
pay for any "real" infrastructure.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Tests
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>I don't write tests when I start a side project. I might never, depending on the
specific risks. I mainly use Go and Ruby. In Ruby tests verify you're calling
things correctly and they're returning things correctly. In Go your tests
generally just check the latter, because the former is enforced at compile time.</p>
</div>
</div>
</div>
</div>
</body></html>
      </article>
      <footer>
        <p>
          <small>
            <i>
              
                source:
                <a
                  href="https://github.com/glacials/twos.dev/blob/main/src/cold/infra.org"
                  target="_blank"
                  >src/cold/infra.org</a
                >
              
              <br />
              
                published
                2023 February
                
              
            </i>
          </small>
        </p>
      </footer>
    </div>
    <script
  crossorigin="anonymous"
  defer
  integrity="sha384-X/XCfMm41VSsqRNQgDerQczD69XqmjOOOwYQvr/uuC+j4OPoNhVgjdGFwhvN02Ja"
  src="https://cdn.jsdelivr.net/npm/katex@0.16.0/dist/katex.min.js"
></script>
<script
  crossorigin="anonymous"
  defer
  integrity="sha384-+XBljXPPiv+OzfbB3cVmLHf4hdUFHlWNZN5spNQ7rmHTXpd7WvJum6fIACpNNfIR"
  onload="renderMathInElement(document.body);"
  src="https://cdn.jsdelivr.net/npm/katex@0.16.0/dist/contrib/auto-render.min.js"
></script>
<script>
  
  if (document.location.hostname == "localhost") {
    const wsurl = "ws://localhost:8100/ws";
    const socket = new WebSocket(wsurl);
    socket.addEventListener("message", (event) => location.reload());
    socket.addEventListener("close", (event) => {
      console.log("backup initiating");
      setInterval(() => {
        const sock = new WebSocket("ws://localhost:8100/ws");
        sock.addEventListener("open", (event) => {
          location.reload();
        });
      }, 1000);
    });
  }

  
  
  
  
  
  
  
  
  
  if (document.location.path === "/winter") {
    window.location.replace("https://pkg.go.dev/twos.dev/winter");
  }
</script>

  </body>
</html>
